'''
Системный администратор раз в неделю создаёт архив пользовательских
 файлов. Однако объём диска, куда он помещает архив, может быть меньше,
 чем суммарный объём архивируемых файлов. Известно, какой объём занимает
 файл каждого пользователя.
 По заданной информации об объёме файлов пользователей и свободном объёме
 на архивном диске определите максимальное число пользователей,
 чьи файлы можно сохранить в архиве, а также максимальный размер
 имеющегося файла, который может быть сохранён в архиве, при условии,
 что сохранены файлы максимально возможного числа пользователей.
 '''

# считывание данных из файла и складывание их в список lst,
# сортировка списка
with open('#26_27423.txt') as f:
    s, n = map(int, f.readline().split())
    lst = []
    for i in range(n):
        lst.append(int(f.readline()))
lst.sort()
# print(lst)

# суммируем элементы пока их сумма sm меньше заданного s
sm = 0
for i in range(n):
    if sm + lst[i] <= s:
        sm += lst[i]
        mx_i = i
    else:
        break
# print(sm, mx_i, lst[mx_i])

# бежим от последнего элемента предыдущего этапа,
# пытаясь заменять последний элемент нашего списка
# на следующий (больший) элемент last
last = lst[mx_i]
for i in range(mx_i + 1, n):
    if sm - last + lst[i] <= s:
        sm = sm - last + lst[i]
        last = lst[i]
    else:
        break
print(mx_i + 1, last)
