'''
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится троичная запись числа N.
2. В конец записи (справа) дописывается остаток от деления числа N на 3.
3. Результат переводится из троичной системы в десятичную и выводится на экран.
Пример. Дано число N = 11. Алгоритм работает следующим образом:
1. Троичная запись числа N: 102.
2. Остаток от деления 11 на 3 равен 2, новая запись 1022.
3. На экран выводится число 35.
Какое наименьшее четырёхзначное число может появиться на экране
в результате работы автомата?
'''

'''
Описанные действия приведут к умножению исходного числа на 3 и 
довбавление остатка от деления числа на 3
'''

mn = 10000

for number in range(1, 9999 + 1):
    result = number * 3 + number % 3
    if 999 < result < 10000:
        mn = min(result, mn)

print(mn)
